---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LevelAssociationFailures.AllLevelsDeleted
source: html/356a01bc-33b6-feed-1f91-a56396c4ed99.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LevelAssociationFailures.AllLevelsDeleted Property

All Levels from model were deleted

## Syntax (C#)
```csharp
public static FailureDefinitionId AllLevelsDeleted { get; }
```